------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/scripts/logs/2022.
> 02.09-09.18.26.log.txt
  log type:  text
 opened on:   9 Feb 2022, 09:18:26

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time:  9 Feb 2022 09:18:26

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/scripts/lib
> raries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmata
> pss;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/processed/map"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" red
> uces transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS\scripts\05_figureS1_dogma
> tism_scale.do"

. *--------------------------------------------------------------------
. * SCRIPT: 05_figureS1_dogmatism_scale.do
. * PURPOSE: replicates Figure S1 - construction of the dogmatism scale
. *--------------------------------------------------------------------
. *Load dogmatism data from pretest
. use "$working_ANALYSIS/data/pre-test_corona_raw.dta", clear
(pre-test-corona-2021)

. 
. *PCA
. pca dt06_01 dt06_02 dt06_03 dt06_04 dt06_05 dt06_06 dt06_07 dt06_08 dt06_09 dt06_10 dt06_11 dt06_12 dt06_13 dt06_14 dt06_15 dt06_16 dt06_17 dt06_18,
>  blanks(0.15) comp(3) //dt06_18 loads in the opposite direction of what it should -> exlude it

Principal components/correlation                 Number of obs    =        480
                                                 Number of comp.  =          3
                                                 Trace            =         18
    Rotation: (unrotated = principal)            Rho              =     0.4451

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      4.39676      2.44766             0.2443       0.2443
           Comp2 |       1.9491      .283825             0.1083       0.3525
           Comp3 |      1.66527       .34608             0.0925       0.4451
           Comp4 |      1.31919      .342168             0.0733       0.5184
           Comp5 |      .977024      .134502             0.0543       0.5726
           Comp6 |      .842522     .0277673             0.0468       0.6194
           Comp7 |      .814755     .0546579             0.0453       0.6647
           Comp8 |      .760097      .069712             0.0422       0.7069
           Comp9 |      .690385     .0336589             0.0384       0.7453
          Comp10 |      .656726     .0200816             0.0365       0.7818
          Comp11 |      .636645     .0750326             0.0354       0.8171
          Comp12 |      .561612     .0264375             0.0312       0.8483
          Comp13 |      .535175     .0319234             0.0297       0.8781
          Comp14 |      .503251    .00417807             0.0280       0.9060
          Comp15 |      .499073     .0677337             0.0277       0.9338
          Comp16 |      .431339     .0284111             0.0240       0.9577
          Comp17 |      .402928     .0447838             0.0224       0.9801
          Comp18 |      .358145            .             0.0199       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors)  (blanks are abs(loading)<.15)

    ----------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3 | Unexplained 
    -------------+------------------------------+-------------
         dt06_01 |   0.1775    0.3005           |       .6854 
         dt06_02 |  -0.1571    0.1731           |       .8135 
         dt06_03 |   0.3033    0.2409           |       .4823 
         dt06_04 |             0.2610    0.2859 |       .6809 
         dt06_05 |  -0.1849    0.2842   -0.2170 |       .6138 
         dt06_06 |   0.2819    0.3248           |       .4414 
         dt06_07 |  -0.2118    0.3552   -0.2293 |       .4694 
         dt06_08 |   0.2996    0.3093           |       .3986 
         dt06_09 |   0.2546                     |       .6673 
         dt06_10 |  -0.2402    0.1638           |       .6779 
         dt06_11 |  -0.1660    0.3172           |       .6715 
         dt06_12 |   0.3070    0.1940           |       .4839 
         dt06_13 |   0.3386                     |       .4615 
         dt06_14 |   0.1718              0.5553 |       .3557 
         dt06_15 |  -0.2678    0.1712    0.2277 |       .5412 
         dt06_16 |   0.2210              0.4334 |       .4489 
         dt06_17 |  -0.1984    0.3260           |       .5982 
         dt06_18 |  -0.2092              0.4190 |       .4975 
    ----------------------------------------------------------

. 
. *First iteration
. pca dt06_01 dt06_02 dt06_03 dt06_04 dt06_05 dt06_06 dt06_07 dt06_08 dt06_09 dt06_10 dt06_11 dt06_12 dt06_13 dt06_14 dt06_15 dt06_16 dt06_17 , blanks
> (0.2) comp(1)

Principal components/correlation                 Number of obs    =        480
                                                 Number of comp.  =          1
                                                 Trace            =         17
    Rotation: (unrotated = principal)            Rho              =     0.2497

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      4.24465      2.30294             0.2497       0.2497
           Comp2 |      1.94172      .444165             0.1142       0.3639
           Comp3 |      1.49755      .210325             0.0881       0.4520
           Comp4 |      1.28723      .424252             0.0757       0.5277
           Comp5 |      .862976     .0205499             0.0508       0.5785
           Comp6 |      .842427     .0313942             0.0496       0.6280
           Comp7 |      .811032      .103272             0.0477       0.6757
           Comp8 |       .70776     .0233795             0.0416       0.7174
           Comp9 |      .684381     .0277818             0.0403       0.7576
          Comp10 |      .656599     .0311992             0.0386       0.7963
          Comp11 |        .6254     .0651084             0.0368       0.8330
          Comp12 |      .560291     .0381366             0.0330       0.8660
          Comp13 |      .522155     .0203154             0.0307       0.8967
          Comp14 |      .501839     .0172479             0.0295       0.9262
          Comp15 |      .484591      .081171             0.0285       0.9547
          Comp16 |      .403421     .0374485             0.0237       0.9785
          Comp17 |      .365972            .             0.0215       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors)  (blanks are abs(loading)<.2)

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
         dt06_01 |          |       .8433 
         dt06_02 |          |       .8952 
         dt06_03 |   0.3118 |       .5875 
         dt06_04 |          |       .9553 
         dt06_05 |          |       .8462 
         dt06_06 |   0.2879 |       .6481 
         dt06_07 |  -0.2205 |       .7936 
         dt06_08 |   0.3058 |       .6031 
         dt06_09 |   0.2670 |       .6975 
         dt06_10 |  -0.2392 |       .7572 
         dt06_11 |          |       .8826 
         dt06_12 |   0.3073 |       .5991 
         dt06_13 |   0.3472 |       .4882 
         dt06_14 |          |       .8391 
         dt06_15 |  -0.2573 |        .719 
         dt06_16 |   0.2362 |       .7633 
         dt06_17 |          |       .8371 
    --------------------------------------

. matrix list e(L)

e(L)[17,1]
              Comp1
dt06_01   .19211705
dt06_02  -.15710494
dt06_03   .31175348
dt06_04  -.10265834
dt06_05  -.19037083
dt06_06   .28793134
dt06_07   -.2205178
dt06_08    .3057879
dt06_09   .26696984
dt06_10  -.23917349
dt06_11   -.1662883
dt06_12   .30731653
dt06_13   .34724715
dt06_14   .19470919
dt06_15  -.25728402
dt06_16   .23615773
dt06_17  -.19588355

. matrix define loadings = e(L)

. 
. preserve

. xsvmat double loadings, names(col) rownames(var) saving("$working_ANALYSIS/processed/dog_pca_pre-test", replace)
(note: file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/processed/dog_pca_p
> re-test.dta not found)
file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/processed/dog_pca_pre-test
> .dta saved

. use "$working_ANALYSIS/processed/dog_pca_pre-test", clear

. gen dropped = 1

. replace dropped = 0 if Comp1 <= -.19 | Comp1 >= 0.19
(14 real changes made)

. encode var, gen(var_nr)

. save "$working_ANALYSIS/processed/dog_pca_pre-test", replace
file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/processed/dog_pca_pre-test
> .dta saved

. 
. twoway (dropline Comp1 var_nr if dropped == 0, horizontal mlabel(Comp1) mlabformat(%12.2f) mlabposition(top)) (dropline Comp1 var_nr if dropped == 1
> , horizontal mlabel(Comp1)  mlabformat(%12.2f) mlabposition(top)  ), ylabel(1(1)17, valuelabel) xtitle(loadings) legend(order(2 "Excluded" 1 "Preser
> ved") rows(1))ytitle("") title("{bf:a } First iteration", pos(11) span)

. graph save "$working_ANALYSIS/results/intermediate/dog_loadings1", replace
(file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/results/intermediate/dog_
> loadings1.gph saved)

. restore

. 
. *Second iteration
. pca dt06_01 dt06_03 dt06_05 dt06_06 dt06_07 dt06_08 dt06_09 dt06_10 dt06_12 dt06_13 dt06_15 dt06_16, blanks(0.2) comp(1) //drop 5 & 7

Principal components/correlation                 Number of obs    =        480
                                                 Number of comp.  =          1
                                                 Trace            =         12
    Rotation: (unrotated = principal)            Rho              =     0.3181

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      3.81761      2.21414             0.3181       0.3181
           Comp2 |      1.60347      .521462             0.1336       0.4518
           Comp3 |      1.08201      .190838             0.0902       0.5419
           Comp4 |      .891171       .12181             0.0743       0.6162
           Comp5 |      .769361     .0614936             0.0641       0.6803
           Comp6 |      .707868     .0866764             0.0590       0.7393
           Comp7 |      .621191     .0116517             0.0518       0.7911
           Comp8 |       .60954     .0446461             0.0508       0.8419
           Comp9 |      .564893     .0240962             0.0471       0.8889
          Comp10 |      .540797      .126338             0.0451       0.9340
          Comp11 |       .41446     .0368353             0.0345       0.9685
          Comp12 |      .377624            .             0.0315       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors)  (blanks are abs(loading)<.2)

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
         dt06_01 |   0.2230 |       .8101 
         dt06_03 |   0.3486 |        .536 
         dt06_05 |          |       .8877 
         dt06_06 |   0.3389 |       .5615 
         dt06_07 |          |       .8621 
         dt06_08 |   0.3512 |       .5291 
         dt06_09 |   0.2945 |       .6689 
         dt06_10 |  -0.2391 |       .7818 
         dt06_12 |   0.3471 |       .5401 
         dt06_13 |   0.3793 |       .4507 
         dt06_15 |  -0.2571 |       .7476 
         dt06_16 |   0.2248 |        .807 
    --------------------------------------

. matrix list e(L)

e(L)[12,1]
              Comp1
dt06_01   .22304367
dt06_03   .34861493
dt06_05   -.1715136
dt06_06   .33891646
dt06_07   -.1900804
dt06_08   .35122582
dt06_09   .29451063
dt06_10  -.23909986
dt06_12     .347086
dt06_13   .37933574
dt06_15  -.25714933
dt06_16   .22483863

. matrix define loadings = e(L)

. 
. preserve

. xsvmat double loadings, names(col) rownames(var) saving("$working_ANALYSIS/processed/dog_pca_pre-test2", replace)
(note: file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/processed/dog_pca_p
> re-test2.dta not found)
file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/processed/dog_pca_pre-test
> 2.dta saved

. use "$working_ANALYSIS/processed/dog_pca_pre-test2", clear

. gen dropped = 1

. replace dropped = 0 if Comp1 <= -.20 | Comp1 >= 0.20
(10 real changes made)

. save "$working_ANALYSIS/processed/dog_pca_pre-test2", replace
file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/processed/dog_pca_pre-test
> 2.dta saved

. 
. use "$working_ANALYSIS/processed/dog_pca_pre-test", clear

. keep var var_nr

. merge 1:1 var using "$working_ANALYSIS/processed/dog_pca_pre-test2"

    Result                           # of obs.
    -----------------------------------------
    not matched                             5
        from master                         5  (_merge==1)
        from using                          0  (_merge==2)

    matched                                12  (_merge==3)
    -----------------------------------------

. 
. twoway (dropline Comp1 var_nr if dropped == 0, horizontal mlabel(Comp1) mlabformat(%12.2f) mlabposition(top)) (dropline Comp1 var_nr if dropped == 1
> , horizontal mlabel(Comp1)  mlabformat(%12.2f) mlabposition(top)  ), ylabel(1(1)17, valuelabel) xtitle(loadings) ytitle("") title("{bf:b } Second it
> eration", pos(11) span)

. graph save "$working_ANALYSIS/results/intermediate/dog_loadings2", replace
(file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/results/intermediate/dog_
> loadings2.gph saved)

. restore

. 
. 
. *final 
. pca dt06_01 dt06_03 dt06_06 dt06_08 dt06_09 dt06_10 dt06_12 dt06_13 dt06_15 dt06_16, blanks(0.2) comp(1)

Principal components/correlation                 Number of obs    =        480
                                                 Number of comp.  =          1
                                                 Trace            =         10
    Rotation: (unrotated = principal)            Rho              =     0.3654

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      3.65381      2.38598             0.3654       0.3654
           Comp2 |      1.26783      .351438             0.1268       0.4922
           Comp3 |      .916394      .122351             0.0916       0.5838
           Comp4 |      .794042     .0451227             0.0794       0.6632
           Comp5 |       .74892      .105321             0.0749       0.7381
           Comp6 |      .643599     .0256288             0.0644       0.8025
           Comp7 |       .61797     .0731495             0.0618       0.8643
           Comp8 |       .54482      .120423             0.0545       0.9187
           Comp9 |      .424398     .0361816             0.0424       0.9612
          Comp10 |      .388216            .             0.0388       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors)  (blanks are abs(loading)<.2)

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
         dt06_01 |   0.2415 |       .7869 
         dt06_03 |   0.3663 |       .5098 
         dt06_06 |   0.3577 |       .5325 
         dt06_08 |   0.3766 |       .4818 
         dt06_09 |   0.3048 |       .6606 
         dt06_10 |  -0.2350 |       .7982 
         dt06_12 |   0.3674 |       .5068 
         dt06_13 |   0.3857 |       .4566 
         dt06_15 |  -0.2517 |       .7686 
         dt06_16 |   0.2064 |       .8444 
    --------------------------------------

. matrix list e(L)

e(L)[10,1]
              Comp1
dt06_01   .24147865
dt06_03   .36628927
dt06_06   .35770033
dt06_08    .3765949
dt06_09   .30476303
dt06_10  -.23502118
dt06_12   .36739103
dt06_13   .38565709
dt06_15  -.25165725
dt06_16   .20637974

. matrix define loadings = e(L)

. 
. preserve

. xsvmat double loadings, names(col) rownames(var) saving("$working_ANALYSIS/processed/dog_pca_pre-test3", replace)
(note: file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/processed/dog_pca_p
> re-test3.dta not found)
file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/processed/dog_pca_pre-test
> 3.dta saved

. use "$working_ANALYSIS/processed/dog_pca_pre-test3", clear

. gen dropped = 1

. replace dropped = 0 if Comp1 <= -.20 | Comp1 >= 0.20
(10 real changes made)

. save "$working_ANALYSIS/processed/dog_pca_pre-test3", replace
file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/processed/dog_pca_pre-test
> 3.dta saved

. 
. use "$working_ANALYSIS/processed/dog_pca_pre-test", clear

. keep var var_nr

. merge 1:1 var using "$working_ANALYSIS/processed/dog_pca_pre-test3"

    Result                           # of obs.
    -----------------------------------------
    not matched                             7
        from master                         7  (_merge==1)
        from using                          0  (_merge==2)

    matched                                10  (_merge==3)
    -----------------------------------------

. 
. twoway (dropline Comp1 var_nr if dropped == 0, horizontal mlabel(Comp1) mlabformat(%12.2f) mlabposition(top)) (dropline Comp1 var_nr if dropped == 1
> , horizontal mlabel(Comp1)  mlabformat(%12.2f) mlabposition(top)  ), ylabel(1(1)17, valuelabel) xtitle(loadings) ytitle("") title("{bf:c } Final set
> ", pos(11) span)

. graph save "$working_ANALYSIS/results/intermediate/dog_loadings3", replace
(file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/results/intermediate/dog_
> loadings3.gph saved)

. restore

. 
. grc1leg  "$working_ANALYSIS/results/intermediate/dog_loadings1" "$working_ANALYSIS/results/intermediate/dog_loadings2" "$working_ANALYSIS/results/in
> termediate/dog_loadings3", rows(1) 

. gr export "$working_ANALYSIS/results/figures/FigureS1_dogmatism.tif", replace
(file C:\Users\istei\Google Drive\Promotion\1_Projects\Corona_Deutschland\Submissions\PLOS ONE\Submission 2\replication_PLOS/results/figures/FigureS1_
> dogmatism.tif written in TIFF format)

. 
. 
. 
. 
. 
. ** EOF
. 
end of do-file

. exit, clear
